{
  "October 16, 2023": [
    "code_monki: 👋\nmawburn: heyo\nmawburn: welcome to the first from the posts! ha\ncode_monki: I've built a couple of hobby projects:\n\nTraveller Central Supply Catalog\nMythic Space Sector Generator\nmawburn: I deleted the older conversations here, but basically I'm just getting started to build this up\nmawburn: oh cool! I'll add them to the site\ncode_monki: I'm working on others but I haven't finished them yet.\nmawburn: what is the mythic space generator?\nmawburn: like MGME?\ncode_monki: It's a sector generator for the Mythic Space TTRPG.\ncode_monki: I'm working on a random mission generator for it but life is getting in the way. 😂\ncode_monki: I've also got some projects in the queue for Mutant: Year Zero, Esper Genesis, and Knave.\ncode_monki: Too many projects, not enough hours in the day. 😕\nmawburn: oh cool, that sounds interesting. You'd probably like Across a Thousand Dead Worlds then\nmawburn: that was literally my github status for a long time. lol\nmawburn: well \"too many ideas, not enough energy\"\ncode_monki: The Traveller project is intentionally retro-looking. I'll eventually get around to \"modernizing\" it at some point. 😂\nmawburn: https://github.com/mawburn\nmawburn: oh it's still there\ncode_monki: I'm also working on some plug-ins for the Obsidian note taking app. Jeremy Valentine has done some really cool stuff to support TTRPGs for 5e/Pathfinder, but I'm trying to suss out stuff for other systems.\nmawburn: yeah that's what I use too, I love it. But I can't use it on my work computer\ncode_monki: The catalog is built with Eleventy and the other one is just an SPA. I'm learning Dart/Flutter right now because then I can generate native binaries or a web site from a single code base.\nmawburn: I use LoqSeq for work, originally I hated it but it's default journalling thing is actually a lot better for work\nmawburn: I used Obsidian to publish a couple ideas\nmawburn: like on the web, not books\ncode_monki: Cool, I'll have a look at it. I'm always looking for tools that will help fill a niche.\ncode_monki: Obsidian.md offers a publishing option that is hosted. Do you know if loqsec does that or if the hosting is on the individual? (I suspect it's the latter).\nmawburn: no, it doesn't really even offer syncing\nmawburn: but it's good for work. Obsidian is objectively better\nmawburn: I did sponsor a video on QB once though\nmawburn: right at a year ago now actually\nmawburn: https://www.youtube.com/watch?v=e-Cfo5nkp3k\nmawburn: literally one of this lowest viewed videos\nmawburn: heh, I just realized Mythic is also the name of my local con. lol\nmawburn: where are you at regionally  and ? I'm in Charlotte, NC USA.\nSynyster328: Fargo, ND\nfunkbgr: \nmawburn: oh cool. When I was graduating college I had an interview in Pierre, SD that paid really well. I went through with it because I had heard of it before, but I was confusing it with Sioux Falls so I noped out after I Googled it. lol\ncode_monki: I bounce back and forth between Austin, TX (home of Steve Jackson Games although I don't work there) and the Seattle, WA area.\nSynyster328: Right on, I'm from the Washington Coast\nmawburn: oh cool. My last job my entire team was in Austin, so I spent a lot of time there. \n\nMy favorite youtuber just did a DCC review today.\nmawburn: https://www.youtube.com/watch?v=GJK5Vg07ktU\nmawburn: yeah I lived in Quinault for a year when I was 8 and hated it so much. Been wanting to go back ever since I became an Adult but it's pretty much just as expensive to fly out there as it is to Europe.\ncode_monki: I had the same issue when my mother was still living in SE Oklahoma. I could either hub through D/FW or direct to OKC. The only difference was the length of the drive.\nmawburn: yeah Charlotte is a hub so I can pretty much get a direct flight to anywhere. We moved here from central Arkansas so getting direct flights to Little Rock is very nice.\nmawburn: but Charlotte is one of the highest prices to fly out of. It's constantly on the Charlotte reddit. We can literally drive up to Raleigh, have a connection in CLT, and you'll save $200-400/ticket.\nmawburn: btw, have you seen this? It's for Stars Without Number but the UI is one of the best for a TTRPG tool I've seen. \n\nhttps://sectorswithoutnumber.com/\nmawburn: I'm secretly hoping we can get some good Designers in here too. I want to collab so bad.\ncode_monki: Yup. There's also the Traveller Wiki and the Traveller Map.\nmawburn: I'll probably update that list of tools on the showcase page to be based on either a JSON file or CMS and have what games they are for attached to them.\ncode_monki: I tell folks all of the time that I'm not a UI/UX guy, just an implementor, but I keep getting asked to design stuff. Def not my forte, but I do what I can.\nmawburn: I haven't played Traveller, for some reason it doesn't interest me but it's probably because from an outsider's perspective it gives me GURPS vibes. \n\nI actually almost bought a bunch of their core books recently though, but ended up buying board games instead.\ncode_monki: Well, GURPS is really it's own thing. I've got a lot of GURPS stuff, and for worldbuilding or lore, it's nice. Traveller pre-dates GURPS and is more of a toolbox that happens to have lore with it. I think of it as a bunch of mini-games (system generation, character generation, ship/vehicle/weapon generation, etc.). Probably more towards the \"crunchy\" end of things, but during play the rules pretty act like a lightweight set that stay out of the way. Everything else is more for the GM to build scenarios.\nmawburn: yeah I'm a FED and I have artistic ability, but I am not a UI Designer. Like I just straight up copied my personal page. \n\nMy page  from \ncode_monki: But, it's an individual choice thing. FWIW, I also have Space Opera which is one of the most \"detailed\" set of rules that tends toward micromanagement.\nmawburn: oh yeah, I know. I actually like a lot of the GURPS supplements, but not really interested in the system.\nhaxta: \ncode_monki: Hey, I always tell people that amateurs plagiarize and apologize, professionals just outright S.T.E.A.L. (Strategically Relocate Equipment to an Alternate Location).\ncode_monki: 😂\ncode_monki: And we never apologize.\nmawburn: lol even designers do it\nmawburn: they are just better at it\ncode_monki: I played the Fantasy Trip (Melee/Wizard) and knew Steve Jackson from the SCA, so I understand where he's coming from. I just don't care for games that require everyone to be a bookkeeper.\nmawburn: \nmawburn: pinning those so I remember to add them\ncode_monki: What a lot of folks don't apparently know is that Steve Jackson, E. Gary Gygax, and Marc Miller were all wargamers first and that influenced a lot of their thinking with regards to rules. And Steve Jackson was particularly devoted to realism where the other two weren't.\nmawburn: my favorite system is Savage Worlds which was originally a Wargame too.\nmawburn: Rail Wars -> Deadlands (classic) -> Savage Worlds\nmawburn: it's still one of the better wargamey systems. But Lancer is what I use to compare Tactical Combat against now\ncode_monki: I'm still looking for a good set of rules for Steampunk. I can munge things together in different systems, but I haven't really found anything that provides the right level of crunch and worldbuilding resources (worlds, tech, etc.).\ncode_monki: I've got a Mutant: Year Zero game starting this coming weekend so I'll see where that goes. 😂\ncode_monki: My players said they were preparing for the coming zombie apocalypse. 🙄\nmawburn: NICE! that's one of my favorite settings. I also started r/Zone_Wars becuase I am absolutely hyped about that\nmawburn: Andy Chambers and Ivan collab, like 🤯  I have no idea why it doesn't have more hype.\nmawburn: and it looks so good\ncode_monki: Unfortunately I missed out on the Kickstarter and Free League has the rules but no minis available on their site. So I'm trying to source STLs so that I can 3D print some minis. \nmawburn: I have a few hero forge ones posted on that sub\nmawburn: https://www.reddit.com/r/Zone_Wars/comments/12zrl5d/nova_cult_plutonia/\ncode_monki: Nice. I'll have to play around with HeroForge.\ncorporat: \nmawburn: r/rpg deleted my thread 😦 bummer. Welcome all the new people though!  and \nmawburn: I have a bunch more queued for the rest of the week and some starting in November\nhaxta: Hello\ncorporat: Hiya! I follow /r/rpg on Feedly, so I found you after they deleted it 😅\ncorporat: I'm one of the ringleaders at the League of Extraordinary Foundry VTT Developers, which used to organize events and promote open source modules on Foundry. Right now I work with publishers to make their content VTT-ready\nmawburn: awesome, I'm in there. I was thinking about posting there but wasn't sure where. I was one of early ones asking about TS support. lol\ncorporat: Atropos, Foundry's founder, has some nonstandard opinions of TS and is uninterested in official support. We were able to keep up with an unofficial types repo only for a little while. V10 types support was never completed and now we're on V11. The lead for that project got sick of it and so it's in a little bit of limbo\ncorporat: As for posting discord self-promotion, there's probably not a great spot for it and it's probably not relevant anymore. It's no longer an active community\nmawburn: yeah ngl, I'm slowly becoming less of a fan of Foundry than I was initially.\nmawburn: I've been using it since the first year it was public\nmawburn: the heavy push for DX over UX is kind of not a good direction, even though I do think pushing DX is very important.\nmawburn: I don't dislike it yet, but worried about the direction\nkristianserrano: \nkristianserrano: I recognize a few names here\nkristianserrano: Sent the link to a couple of others I know\nmawburn: drop your links here so I can add them to the showcase. I was probably going to add your SWADE raise calc anyway\nkristianserrano: Should I just add them to the showcase directly?\nmawburn: awesome thanks! I am glad people are liking the idea. I figured nobody would join. I just really like tech, tabletop games, and talking about both of those things. lol\nmawburn: um, no. I think I'm going to change up how that works. Make it look more like a list of blocks. I'll remove that one the welcome message and probably just move it to something like a JSON file or CMS or something.\nmawburn: I'm going to make it look more like the conventions area of this:\n\nhttps://cltrpg.com/#conventions\nkristianserrano: Cool\nkristianserrano: Here's an easy link to those online tools: https://immaterialplane.com/online-tools/\nmawburn: \nmawburn: thanks, right now I'm just pinning them. I'll throw that together tonight. Backlinks always help.\nmawburn: and if we get enough I can always build a filter/search too\nkristianserrano: Should I link to my FVTT stuff?\nmawburn: Yeah, I didn't think about that till  joined. I'll probably add a whole new section for that.\nkristianserrano: https://foundryvtt.com/community/kristianserrano/packages\nfloradical: \nmawburn: \nmawburn: heyo  long time no see!\nfloradical: The homepage has a disturbing lack of an Angular logo :T\nfloradical: heyoooooo\nmawburn: Maybe that was that on purpose? \nfloradical: but then why is there Vue and React xD\nmawburn: lol I was actually waiting till someone asked about it. I just threw a bunch of random stuff on there. No judgement here for using something so awful. 🤣\nfloradical: xD\nfloradical: Angular is by far the best framework xD\nmawburn: we can agree to disagree on that lol\nfloradical: fair ^^\nmawburn: I do like the idea behind RxJS though\nfloradical: it can be useful\nfloradical: but it can also end in callback hell xD\nfloradical: _does angular as the dayjob_\nmawburn: oof. Do you actually like it or does it just pay the bills?\nfloradical: I love it\nmawburn: I have heard Svelete has gotten a lot better since I used it when I was trying to make a custom SWADE character sheet. \n\nMy biggest complaint (among a few others) was how weird styles were in Svelete, but now TailwindCSS is basically my default most of that is not important and actually might even be better due to specificity.\nfloradical: lol nice\nfloradical: tbh with standalone components and the new signals, angular has gotten a lot better too\nfloradical: no modules anymore!\nmawburn: preact is adding signals too, idk if it's the same thing\nmawburn: I have been using Jotai/Recoil in React lately and signals are sort of the same concept of atomic state\nmawburn: I think Preact Signals will be a standalone library\nfloradical: and they're working on adding vite as the dev server with esbuild for prod builds\nfloradical: so nice\nmawburn: oh that's cool, I do like Vite\nfloradical: coworker of mine started using react native and his summary was \"it's just worse angular\" xD\nmawburn: react native !== react\nfloradical: yeah fair. I know my lane and can't really judge it\nmawburn: it's just the same pattern, afaik. But it's definitely not the same thing.\nmawburn: I've been a React Dev since 2015 and I haven't worked in it, but I've never met anyone who says that they loved React Native. lol\nfloradical: lol\nfloradical: so what IS preact anyway, other than react with an extra P\nfloradical: (I kid of course, I really have no clue)\narchitech99: \nmawburn: yeah my company actually bought it. \n\nBut years ago, well before this company, but I remember listening to Jason Miller talk about it on a podcast and saying he started it just to see how React worked. \n\nBut basically, it's a really stripped down version of React that is much smaller and has feature parity for the most part. There are some bugs here and there that don't exist in React, but other than those edge cases it's not really noticeable that you're working in one vs the other.\nmawburn: > Fast 3kB alternative to React with the same modern API\nmawburn: the tagline from the site\nfloradical: fancy\nmawburn: yeah, it's not bad. I'd never use it for a personal project tbh.\nmawburn: but we acquired it sometime last year I think? something like that? I actually can't find any news articles about it, except 1 random tweet.\nmawburn: we also bought Remix around the same time. That is something I definitely like. I still kinda like NextJS more, but Remix is solid.\nmawburn: I would say it's better in some ways, but it's definitely a lot less tied to our company than NextJS is tied to Vercel.\nmawburn: I WAS thinking about adding a preact module to Foundry similar to the Vue one though, but I really don't want to keep up with that. lol\nkristianserrano: Woot!  is here!\narchitech99: At least in between troubleshooting my new mesh network setup.\nkristianserrano: Nice\nfloradical: aqquired how? like bought the repo?\nmawburn: bought the company, both of the main devs worked for us but one left on his own. Jason is still here though.\nfloradical: tbh with what'S comming with microfrontends and es module federation to angular and Application V2 in foundry I am really temtped to build and angular adapter for v12 xD\nfloradical: oh damn nice\nmawburn: I think Svelte is the way to go with Foundry stuff\nmawburn: no framework, just code\nfloradical: sure\nfloradical: but that's _boring_\nfloradical: \nmawburn: lol less dependency issues\nmawburn: that's kinda why I didn't even bother with the Preact thing\nmawburn: the Vue library is probably a NIGHTMARE to maintain.\nfloradical: maybe. No idea. You'd have to ask cody\ncode_monki: , I'm working on a quick and dirty way to do oracles in Obsidian.md. I'll shoot you a write-up if you're interested.\nmawburn: yeah sure\nkristianserrano: Is the League really no longer active?\nfloradical: I think it's active?\nfloradical: but it's definetly slower. people are a bit burned out\nkristianserrano: OMG, speaking of... You know you're tired and have been staring at code for too long when you literally think through and write the same block of code twice!\nkristianserrano: At least I was consistent both times.\nfloradical: hehe\ncorporat: if there is interest to do something more with it, we could discuss it. But as of yet there will not be a package jam this year or any new initiatives. Everyone's still around but working on their own stuff\nkristianserrano: Understandable\ncorporat: in fact, Cris from Material Foundry was interested in sponsoring a category for the package jam and I said \"we'd be happy to ping developers to promote your own jam.\" That's still a thing we could do but he's also too busy to run an event\nmawburn: I need to tweak the design, probably make them more square but I added them here:\nhttps://dicengineers.com/showcase\nkristianserrano: Nice\nrolentle: \nSynyster328: This is awesome! Nicely done"
  ],
  "October 17, 2023": [
    "Synyster328: To anyone interested (and on Android), I'm going to be sending out a beta for my rules chatbot this week\nsnakeeyesnc: \nmawburn: heyo  are you in North Carolina?\nmawburn: just curious as someone in Charlotte\nmawburn: technically in SC though\nmawburn: also, I just want to call out that  joined us last night. He likes to do Ruby talks based on D&D. 🤣\nrolentle: I am all pathfinder and python now lol\nmawburn: Scala and Starfinder next?\nmawburn: Typescript and Traveller is more my style\nmawburn: ...I actually need to play that game. I haven't even read it\nrolentle: #Fate (Fate Sharp)\n_bluesix: \nnaith: I’ve got such a massive hankering to run traveller right now\nchiel4396: \nx4rising: \ndustinhendrickson: \nnotaferret: \nnotaferret: Hi all\nmawburn: hey hey!\nmawburn: cool that post got a few more additions! 👋\nnotaferret: Totally, perfect timing for me\nmawburn: how so?\nnotaferret: I’ve been messing around with digitizing some board games\nmawburn: on a side note, I just tested an upgrade to pro on vercel, MOSTLY to get more analytics on several domains and you don't even get the hobby tier analytics there and each property costs $10/mo more for the analytics.\nmawburn: oh nice, on what platform? web?\nnotaferret: Ya, web\nmawburn: what do you work in normally?\nsnakeeyesnc:  I am in North Carolina!  Triangle area, though.\nmawburn: nice. I like it down here and I work remotely. Are you a full time dev?\nmawburn: I'm down in Ft. Mill, SC just over the line. \n\nI used to commute by Puckerbutt every day until COVID then moved jobs. They just released the world's hottest pepper... AGAIN!\nsnakeeyesnc: Yeah, I am.  I work remotely full-time, too.  Been in NC for about 20 years.  Originally, I'm a northerner and ran from too many cold and snowy winters.\nmawburn: ah nice, yeah I moved here about 5yrs ago from Arkansas. I have lived a lot of places and consider VA where I grew up because that's where my formative years were spent. \n\nI was in Arkansas for about 14yrs cause I kinda got stuck during and after college, but I was born there too. Then I've lived in like 4 other states, but never been above Maryland actually.... except for a layover in Maine.\nmawburn: Anyone backing X-Men Dice Throne?\nmawburn: I backed Marvel Dice Throne at the top tier, but it didn't have an adventure campaign with it and I actually haven't even opened it yet. lol \n\nDice Throne is one of my favorite board games though. I just backed the Deadpool addon and will probably buy whatever 2 pack comes with Gambit when it comes out.\nperiodicchaos: "
  ],
  "October 18, 2023": [
    "perfect.6lue: \nfloradical: so here's a question\nfloradical: do we get rolls based on stuff?\nmawburn: roles or rolls? (legit not sure what you meant here 🤣  I figure role though)\nmawburn: I was thinking about roles, or just keeping everyone equal. I can do reaction roles in the welcome & rules, but wasn't sure what to add. \n\nThe chat could use more color though. I was thinking a role where you pick your favorite language or something so we can color code based on that.\nmawburn: WDYT?\nmawburn: I am a serial community creator and this is honestly a much better start than I expected. Starting is hard. I didn't think people would be interested in my dumb little idea, but I'm super glad everyone here is. I really like combining my hobbies and building apps for stuff I'm in to.\nmawburn: I mean, I came up with idea a couple weeks ago and it sat idle until I saw  post about hit Boardgame Buddy app on r/boardgames and sent them a DM. Never met them before.\nfloradical: yes roles lol sorry\nfloradical: too deep into foundry atm\nfloradical: rolls, roles, who cares, have some dice\nmawburn: so I threw together the landing page the next day and setup the basics of the server. I've ran a lot of servers and my biggest was >3000\nmawburn: yeah I get it. I just legit wasn't sure. lol What kind of roles should we have? \n\nWDYT about the single \"favorite\" language and color code based on that?\nmawburn: obviously most of us probably know many, but everyone has a favorite\nmawburn: btw, if you don't mind me asking. Who do you work for  ? Like who at PEG? You can DM me if you like. \n\nI'm asking, because Jodi and Clint are locals and I have been really wanting to corner them at my local con to talk them into Shopify because I hate their site. lol \n\nI actually might have a chance this year finally (I've never really talked with either of them much) because I was able to get Karl Keesler and Eric Lameroux to come! It took a lot of pestering. 😆\nmawburn: I didn't pester them to come because of that. I just wanted to meet them. I actually heard about the con from Eric who is a Canadian living in Pennsylvania and I'm in Charlotte (about 600mi away)\nfloradical: It's a complicated situation. I technically am a contractor for Sigil Services, a VTT content provider but I got there via PEG, and all I do is Savage Worlds\nmawburn: and I was a big fan of the Wild Die podcast\nfloradical: Sigil was an offshoot of PEG IIRC\nmawburn: oh ok, that actually makes a lot more sense. I didn't know about that company. \n\nthat is one of the ideas I've been tossing around in this server if it got popular enough, was a way for people to connect with contractors. But that's dangerous ground and would have to be HEAVILY moderated.\nmawburn: like, I would hire a Designer if I knew any that understood the market.\nmawburn: Not anything I would want to take a cut of or whatever, but if it was that big I'd probably reopen my Patreon.\nfloradical: makes sense\nmawburn: but yeah, back to the other topic. Roles. What are you thinking?\nfloradical: I think a broad overview of Backend/Frontend/Fullstack would be a good overview I guess\nmawburn: do you think languages would cover that? like if your favorite is Ruby, you're probably a BE? I could throw up NodeJS as an option to cover that better instead of just JS/TS\nfloradical: ehhh maybe but there's a LOT of languages so covering them is a daunting task and some do both, like PHP, JS, and probably a bunch of others.\nfloradical: I've been looking into getting some web design training via the dayjob 😄\nfloradical: it's something I wanna learn in the long run\nmawburn: design is definitely rough\nmawburn: I'm artisically minding (I guess is the right way to put it) but design has so much nuance\nfloradical: also a role and color for mods maybe lol\nmawburn: but I wanna be blue! lol\nmawburn: I'll definitely make a separation though if we need it. Generally servers don't need moderators until they get really active. Right now it's just me and I have the crown thingy.\nfloradical: dabedi dabedei\nfloradical: that's fair enough\nfloradical: I'm green dabedi dabedei xD\nmawburn: I'm not sure how you selected multiple\nmawburn: lol\nmawburn: oh\nmawburn: it just didn't remove your reaction\nmawburn: I get it\nfloradical: I I thought I just select all that apply\nnaith: Yet more python hate smh\nmawburn: oh yeah that exists lol\nmawburn: I actually ran out of emojis on the server and was basing it on that lol\nmawburn: ok I spent way too long on that\nmawburn: but there it is. lol\nmawburn: getting id's of emojis is annoying\nmawburn: \nmawburn: the only way I could figure out how to do it was to copy the link from the emoji and take the id off\nmawburn: \nnaith: They are pretty nice\nmawburn: edit: nvm had the folder name wrong. derp\nmawburn:  if you have any projects to add, can you try out that form link in the  ? \n\nAnyone else is welcome to as well.\nfloradical: Hm, all I have is the foundry SWADE system. I've got a few things cooking but only on the backburner atm\nmawburn: you can put that on there. But since it's a contract I would understand if you didn't want to.\nfloradical: BOOm, done :D\nmawburn: ty\nfloradical: I am sorta working on my other project LoreWeaver but that one is slow going because all my other hobbies take up so much time ^^\nmawburn: sweet, that was painless. I like these new forms.\nmawburn: what is that? I have so many side projects though. lol\nfloradical: it's supposed to be a self-hosted worldbuilding tool, akin to Kanka or WorldAnvil\nfloradical: but I never liked those other tools, they seemed clunky, so I figured I'd try to roll my own, using Node/NestJs for the backend and Angular for the front. I was even thinking of doing SSR angular, but I also wanted PWA capabilities so you could save articles and take them with you offline\nfloradical: mostly I was struggling with the DB setup. I went back and forth between different solutions but ultimately settled on SQLite for portability reasons\nmawburn: oh cool. I've always wanted to do what I have just been calling \"Github for GMs\" thing for a while, it's probably my oldest idea in this space. \n\nWhich is kind of a similar thing to World Anvil, except I want people to be able to add and tweak things with different versions of things people publish. Like think of a monster someone creates, say an Illithid, and it has status and rules for D&D, SW, PF, etc. Plus lore or alternate versions of lore for different settings and what not.\nmawburn: I really like Supabase. It's very very good and cheap for things that dont have high traffic. The auth is crazy simple.\nmawburn: and the DB is just a PostgreSQL db.\nmawburn: alternatively, you could use something like Hasura.io and host a PostgreSQL DB yourself somewhere and have that in front of it so you dont' kill the connection limit with NextJS\nmawburn: its really easy to setup\nfloradical: ah, hm. I wanted something that could be used offline. You download it, run it and then you are responsible for it. I have no interest in maintaining user databases and the like. Your instance, your circus\nfloradical: kinda like foundry\nmawburn:  is working on some https://obsidian.md stuff\nmawburn: I love that tool\nmawburn: I have a plugin to publish stuff, which is pretty nice. Their sync service is too expensive to justify, but there is a dropbox plugin to sync stuff too (dropbox has an API key)\nfloradical: obsidian is nice but my main inspiration was the ChronoDex https://preview.drivethrurpg.com/en/product/250244/The-Chronodex--Core-Set\nmawburn: Here are a couple things I \"published\" with it. Not really related to your idea, just kind of some of the power it has. \n\n- \n- \nmawburn: I haven't seen that before. I jsut grabbed it\nfloradical: It's pretty good for campaign management. My idea was to effectively make a web version of that tool (since it's CC anyway) with some maps (through leaflet) and other goodies\nmawburn: ah yeah, this is cool. It could be accomplished as an obsidan plugin for sure\nfloradical: sure but that would be easy xD\nfloradical: and while I like obsidian I also wanted to be able to share links with players to specific articles. So you wouldn't have to install anything\nfloradical: think of it as more of a wiki with permissions and everything\nmawburn: yeah, that web plugin thing would work for that. lol\nmawburn: but more setup\nmawburn: and not something everyone can do\nmawburn: you dont' need SSR if you're just doing an Electron or whatever the new one is called, app\nfloradical: I've been looking at electron alternatives and so far I've not actually found anything I really liked\nfloradical: Neutralino and Tauri all have their own drawbacks\nmawburn: https://tauri.app/\nmawburn: that's the one that is flavor of the month\nfloradical: stuff like needing an entire second language for the backend or needing to compile the entire app on every change\nmawburn: I've never worked with any of them though, outside of something super small with electron a long time ago\nfloradical: for example while I like the idea of rust I have no intention of learning it and thus an entirely new ecosystem when I can already do what I want with the tools and languages I have\nmawburn: oh yeah I want to learn that badly\nmawburn: I can see it becoming what C++ is to Python for JS/TS.\nfloradical: if I do rust now I am essentially back to 0 on a technical level and I'd rather solve architectual problems like how are my entities connected and not \"why is there a null pointer\"\nmawburn: the Node support for it is already pretty good, much better than C++ and then Deno is also working on making it a core feature since it's also built on Rust.\nmawburn: yeah, I would use it for like small tasks that need to be fast. I may start making a few libraries with it on NPM.\nmawburn: Python is crazy fast because you barely even write programs with it. You just call libraries that are written in C++ to do the stuff for you. lol\nmawburn: it's like a C++ scripting language\nmawburn: (I realize that is not totally accurate btw)\nfloradical: you also need a ruler for debugging and the lack of type-safety annoys me lol\nmawburn: in Rust? yeah, I don't know much about it\nfloradical: no in python xD\nfloradical: I know that's wild coming from a JS/TS dev\nmawburn: oh I was about to say,  I thought Rust was type safe.\nfloradical: TS is just comfy for me.\nfloradical: typesafety is one of rusts main sellingpoints\nfloradical: sure it's fast but so are go and C.\nmawburn: but yeah, I dont' really use python. But I broke me wrist a couple months ago and was using ChatGPT to write scripts to parse some csv files that were in the GB range and NodeJS was chugging bad. It would take like 15-20min to process a single file. It kept telling me I should use something else and Python was on it's recommendations.\n\nfinally I was like \"fuck it\" and had it do python for me. It dropped from 15-20min to \nfloradical: MicroPython has a lot of caveata attached to it after all\nfloradical: Also I once worked another job where we collated a lot of data using python, pandas and jupyter notebooks.\nfloradical: Hated every second of it, so I am biased\ndingotush: \nmawburn: yeah I don't really care what people choose to use\n\n\n...as long as it's not PHP 🤣\nmawburn: jk, I don't really care there either, I'll just never touch it again. Most of that has to do with a similar situation to you. It was more about the social environment I used it in than the language (it was a side project many years ago)\nfloradical: Yeah same here. No fault of the language or the tools. Just thought doing some more analysis focused work would be fun but damn was it not due to various reasons\nperfect.6lue: if you put `\\` in front of an emoji it will show the id\nmawburn: \\\nmawburn: oh shit\nmawburn: very cool ty!\nfloradical: Damn nice\nSynyster328: I like python but tying behavior to indentation is wild to me lol\nSynyster328: I've been using it for all the backend in my app formerly known as Board Buddy\nSynyster328: Speaking of which, I just started a beta on that. Hit me up if you want access.\nmawburn: I do intend to check it out, just had a lot going on lately and haven't been able to play. lol\nmawburn: did you upload the Arkham Hororr LCG rules or how does that work?\nSynyster328: That's one of the games that I added. The rulebook PDF goes through a pre-processing step and then any user can chat with it\nmawburn: nice!\nmawburn: what model? 4 or 3.5?\nSynyster328: I uploaded the latest version to the playstore so now access is streamlined\n\nhttps://play.google.com/apps/internaltest/4701510819989169678\nmawburn: says not avilable yet, can you add mawburn7@gmail.com?\nSynyster328: Added, you should get access within 5 minutes or so\nmawburn: thanks\nSynyster328: How would I tell? It's using the latest rulebook from 2021\nmawburn: oh I meant GPT model\nSynyster328: Oh, you mean the AI? GPT-4 under the hood to start\nmawburn: yeah that'll get expensive fast. lol\nSynyster328: I always evaluate things using the best of the best to determine viability, then work to optimize from there\nmawburn: 3.5 is kind of trash though, you really have to be really specific with your prompts\nmawburn: like I have a hard time just making it give me back a comma dilemted list\nmawburn: `\"prompt\": \"You will be provided a base theme, then a race, a list of secondary themes, a gender, then followed by a list of name elements. Race and secondary themes may be blank. You will provide a list of exactly 10 random character names based on this criteria and return it separated by commas and will not number them. Usage of real words or names in the generated output are not preferred, but allowed. Use only the Latin alphabet.\",`\nSynyster328: Yeah, working with 3.5 is unpleasant in a lot of cases. A lot of people underestimate just how much of an advancement 4 is from it\nmawburn: even then, I have to have this to handle all the things I've seen come out of it so far:\n```typescript\nfunction transformString(input: string): string[] {\n  if (!/^\\d+[\\.,]\\s*/.test(input)) {\n    return input.split(',').map(name => name.trim())\n  }\n\n  const names = input\n    .split(/\\d+[\\.,]\\s*|\\n/)\n    .filter(Boolean)\n    .map(name => name.trim())\n\n  return names\n}\n```\nmawburn: sometimes it'll come back with a new line, sometimes it'll come back numbered, sometimes it'll come back with bullet points.\nmawburn: and I had one other one slip through last time I was playing with it, but I forgot to check it and was in \"click button\" mode\nSynyster328: Lol that's gotta be fun to debug\nmawburn: yeah just lots of trials, I'll have to automate a few hundred instances to see what all comes out\nmawburn: thankfully this is the kind of thing that ChatGPT can write for me. lol\nmawburn: nothing yet. did you get the right email?\nSynyster328: Whoops! Didn't hit save\nSynyster328: +5 minutes lol\nmawburn: lol\nmawburn: got it.\n\nAre these required?\n```\nIdentity\nfind accounts on the device\nContacts\nfind accounts on the device\n```\nSynyster328: Oh, good call out. Those are the permissions for showing the \"Sign in with Google\" prompt, but that's disabled in the beta.\nmawburn: Looks good. First test didn't go so well but I was kind of ambiguous.\nmawburn: Eh well it was fine I guess. Just a bit wordy.\nmawburn: But yeah that would have definitely been helpful. I've only played it once and we were doing Fight against the Evade of the monster or player. Instead of Fight vs Fight.\nSynyster328: Oh right on. I was torn between brief answers vs answers with enough details\nSynyster328: I'm going to be sending out a survey after a week or two and I might ask about the answers being too long\nmawburn: I think the name itself adds a lot of \"text wall\" to the response.\nmawburn: Also, not sure if you can get it to return a series of steps if needed. I can't think of any prompt conditions off hand that would be generic enough\nmawburn: but I like it so far though, very clean\nmawburn: and the ui is pleasnt to look at\nmawburn: I'm so bad at colors\nmawburn: they are the worst\nmawburn: oh\nmawburn: speaking of, I'm sure that first block will fail contrast\nmawburn: https://webaim.org/resources/contrastchecker/\nmawburn: this is good\nmawburn: \nmawburn: that's really bad\nmawburn: full pass is 7:1\nmawburn: \nmawburn: it's hard to get it at exactly 7\nmawburn: \nmawburn: You could probably ask ChatGPT to find the closest color to your original one to pass lol\nmawburn: \nmawburn: Haven't looked at it. Cause I'm mobile now\nSynyster328: This one was done by the director of Design from one of my previous startups lol I can't pick a theme for shit\nmawburn: lol oh well it looks good. The contrast can be bad for some people though\nmawburn: A lot of designers don't take a11y into account.\ncode_monki: Obsidian.md has a plug-in, DB Folder, that just solved one of my data management / template issues. Muahahahahahaha!"
  ],
  "October 19, 2023": [
    "perfect.6lue: Anyone using boardgame.io? I'm using it for a couple of projects.\nSynyster328: Never heard of that but it looks awesome. How is it to work with?\nmawburn: I've heard of it at some point since I have it starred. lol\nmawburn: don't remember it at all though, it looks cool\nperfect.6lue: It's neat! Make what I want to do so much easier.\nmawburn: I'm trying to understand what it is fully. I didn't really get to take a chance to look around.\nmawburn: if it's easy to do game logic, I've got a couple card games I would like to try\nperfect.6lue: Sounds like it would be useful for you.\nperfect.6lue: It has state management, multiplayer (hotseat, websocket, and p2p with webrtc), storage with a couple of built-in databases + support for redis, mcts bot, lobby. Pretty useful.\nperfect.6lue: You can ping me if you need help.\nmawburn: I was just about to ask about React support but then I clicked their docs and they have React examples 🤘\nmawburn: yeah poking around at the docs, this looks a really nice and unopinionated framework for games\nmawburn: I just realized today that Radix UI went opininionated, I'm so mad at that. The fact it was unopinionated was why it was such a good component library.\nmawburn: ahhhh nvm they renamed it and call it \"Primitives\" now. \n\nhttps://www.radix-ui.com/primitives/docs/overview/introduction\nmawburn: I was showing this to a newbie frontend developer today at work and was like \"WTF!\"\ncorporat: https://venturebeat.com/games/quest-portal-raises-7-6m-and-launches-subscription-for-tabletop-role-playing-games/"
  ]
}
